{"class_name": "Model", "config": {"name": "model_9", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 6], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_7"}, "name": "input_7", "inbound_nodes": []}, {"class_name": "TCN", "config": {"name": "tcn_8", "trainable": true, "dtype": "float32", "nb_filters": 122, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": true, "activation": "selu", "use_batch_norm": false, "use_layer_norm": false, "kernel_initializer": "he_normal"}, "name": "tcn_8", "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_8", "inbound_nodes": [[["tcn_8", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_4", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_4", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "TCN", "config": {"name": "tcn_9", "trainable": true, "dtype": "float32", "nb_filters": 122, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": true, "activation": "selu", "use_batch_norm": false, "use_layer_norm": false, "kernel_initializer": "he_normal"}, "name": "tcn_9", "inbound_nodes": [[["max_pooling1d_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_9", "inbound_nodes": [[["tcn_9", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_5", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_3", "inbound_nodes": [[["max_pooling1d_5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "dtype": "float32", "units": 7, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_9", "inbound_nodes": [[["flatten_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "dtype": "float32", "units": 7, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_10", "inbound_nodes": [[["flatten_3", 0, 0, {}]]]}, {"class_name": "Sampling", "config": {"name": "sampling_3", "trainable": true, "dtype": "float32"}, "name": "sampling_3", "inbound_nodes": [[["dense_9", 0, 0, {}], ["dense_10", 0, 0, {}]]]}], "input_layers": [["input_7", 0, 0]], "output_layers": [["dense_9", 0, 0], ["dense_10", 0, 0], ["sampling_3", 0, 0]]}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}