{"class_name": "Model", "config": {"name": "model_5", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 6], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "Model", "config": {"name": "model_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 6], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "TCN", "config": {"name": "tcn_2", "trainable": true, "dtype": "float32", "nb_filters": 85, "kernel_size": 2, "nb_stacks": 1, "dilations": [1, 2, 4], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": true, "activation": "selu", "use_batch_norm": false, "use_layer_norm": false, "kernel_initializer": "he_normal"}, "name": "tcn_2", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["tcn_2", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_1", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "TCN", "config": {"name": "tcn_3", "trainable": true, "dtype": "float32", "nb_filters": 85, "kernel_size": 2, "nb_stacks": 1, "dilations": [1, 2, 4], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": true, "activation": "selu", "use_batch_norm": false, "use_layer_norm": false, "kernel_initializer": "he_normal"}, "name": "tcn_3", "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3", "inbound_nodes": [[["tcn_3", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_2", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_1", "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_4", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Sampling", "config": {"name": "sampling_1", "trainable": true, "dtype": "float32"}, "name": "sampling_1", "inbound_nodes": [[["dense_3", 0, 0, {}], ["dense_4", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["dense_3", 0, 0], ["dense_4", 0, 0], ["sampling_1", 0, 0]]}, "name": "model_3", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Model", "config": {"name": "model_4", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 16], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "name": "input_4", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 1360, "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_5", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [16, 85]}, "name": "reshape_1", "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"class_name": "UpSampling1D", "config": {"name": "up_sampling1d_1", "trainable": true, "dtype": "float32", "size": 2}, "name": "up_sampling1d_1", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_4", "inbound_nodes": [[["up_sampling1d_1", 0, 0, {}]]]}, {"class_name": "TCN", "config": {"name": "tcn_4", "trainable": true, "dtype": "float32", "nb_filters": 85, "kernel_size": 2, "nb_stacks": 1, "dilations": [1, 2, 4], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": true, "activation": "selu", "use_batch_norm": false, "use_layer_norm": false, "kernel_initializer": "he_normal"}, "name": "tcn_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "UpSampling1D", "config": {"name": "up_sampling1d_2", "trainable": true, "dtype": "float32", "size": 2}, "name": "up_sampling1d_2", "inbound_nodes": [[["tcn_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_5", "inbound_nodes": [[["up_sampling1d_2", 0, 0, {}]]]}, {"class_name": "TCN", "config": {"name": "tcn_5", "trainable": true, "dtype": "float32", "nb_filters": 85, "kernel_size": 2, "nb_stacks": 1, "dilations": [1, 2, 4], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": true, "activation": "selu", "use_batch_norm": false, "use_layer_norm": false, "kernel_initializer": "he_normal"}, "name": "tcn_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_1", "inbound_nodes": [[["tcn_5", 0, 0, {}]]]}], "input_layers": [["input_4", 0, 0]], "output_layers": [["conv1d_1", 0, 0]]}, "name": "model_4", "inbound_nodes": [[["model_3", 1, 2, {}]]]}, {"class_name": "TCN", "config": {"name": "tcn_2", "trainable": true, "dtype": "float32", "nb_filters": 85, "kernel_size": 2, "nb_stacks": 1, "dilations": [1, 2, 4], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": true, "activation": "selu", "use_batch_norm": false, "use_layer_norm": false, "kernel_initializer": "he_normal"}, "name": "tcn_2", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["tcn_2", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_1", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "TCN", "config": {"name": "tcn_3", "trainable": true, "dtype": "float32", "nb_filters": 85, "kernel_size": 2, "nb_stacks": 1, "dilations": [1, 2, 4], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": true, "activation": "selu", "use_batch_norm": false, "use_layer_norm": false, "kernel_initializer": "he_normal"}, "name": "tcn_3", "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3", "inbound_nodes": [[["tcn_3", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_2", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_1", "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_4", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_1", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_1", "op": "AddV2", "input": ["AddV2_1/x", "dense_4/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 1.0}}, "name": "tf_op_layer_AddV2_1", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Exp_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Exp_1", "op": "Exp", "input": ["dense_4/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Exp_1", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sub_2", "trainable": true, "dtype": "float32", "node_def": {"name": "Sub_2", "op": "Sub", "input": ["AddV2_1", "Exp_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sub_2", "inbound_nodes": [[["tf_op_layer_AddV2_1", 0, 0, {}], ["tf_op_layer_Exp_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Square_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Square_1", "op": "Square", "input": ["dense_3/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Square_1", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sub_3", "trainable": true, "dtype": "float32", "node_def": {"name": "Sub_3", "op": "Sub", "input": ["Sub_2", "Square_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sub_3", "inbound_nodes": [[["tf_op_layer_Sub_2", 0, 0, {}], ["tf_op_layer_Square_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sum_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Sum_1", "op": "Sum", "input": ["Sub_3", "Sum_1/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, "constants": {"1": -1}}, "name": "tf_op_layer_Sum_1", "inbound_nodes": [[["tf_op_layer_Sub_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_1", "op": "Mul", "input": ["Mul_1/x", "Sum_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": -1.4877651929855347}}, "name": "tf_op_layer_Mul_1", "inbound_nodes": [[["tf_op_layer_Sum_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mean_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Mean_1", "op": "Mean", "input": ["Mul_1", "Mean_1/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0]}}, "name": "tf_op_layer_Mean_1", "inbound_nodes": [[["tf_op_layer_Mul_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "RealDiv_1", "trainable": true, "dtype": "float32", "node_def": {"name": "RealDiv_1", "op": "RealDiv", "input": ["Mean_1", "RealDiv_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 384.0}}, "name": "tf_op_layer_RealDiv_1", "inbound_nodes": [[["tf_op_layer_Mean_1", 0, 0, {}]]]}, {"class_name": "AddLoss", "config": {"name": "add_loss_1", "trainable": true, "dtype": "float32", "unconditional": false}, "name": "add_loss_1", "inbound_nodes": [[["tf_op_layer_RealDiv_1", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["model_4", 1, 0]]}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}